app/views/main/MainPage.html.erb

SELECT SUM(amount) AS "sum_amount", "categories"."name" AS "categories_name" FROM "categories" INNER JOIN "operations" ON "operations"."category_id" = "categories"."id" WHERE NOT (operations.income != 1 AND operations.odate BETWEEN '2023-02-01' AND '2023-02-28') GROUP BY "categories"."name"
---
      <div class="MainPageRight">
         <%= pie_chart Category.all.where(:user_id == @user.id).group(:name)
         .joins(:operations)
         .where.not("operations.income != ? AND operations.odate BETWEEN ? AND ?", 0 , @current_month_first_day, @current_month_last_day)
         .sum(:amount) %>