app/views/main/MainPage.html.erb

<!--<%= line_chart @user.operations.group_by_day(:created_at).count %> -->
---
SELECT "operations".* FROM "operations"
SELECT COUNT(*) AS "count_all", strftime('%Y-%m-%d', "operations"."created_at") AS "strftime_y_m_d_operations_created_at" FROM "operations" WHERE "operations"."user_id" = ? AND ("operations"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-%d', "operations"."created_at")  [["user_id", 10]]

         <div class= "most_category">
            <h2> <%= @user.categories.first.name %> </h2>
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["user_id", 10], ["LIMIT", 1]]

         <div class = "pie_grpah">
            <%= pie_chart Category.all.where(:user_id == @user.id).group(:name)
            .joins(:operations)
            .where.not("operations.income != ? AND operations.odate BETWEEN ? AND ?", 0 , @current_month_first_day, @current_month_last_day)
            .sum(:amount), donut: true, width: "500px", legend: "bottom"  %>
---
SELECT SUM(amount) AS "sum_amount", "categories"."name" AS "categories_name" FROM "categories" INNER JOIN "operations" ON "operations"."category_id" = "categories"."id" WHERE "categories"."user_id" = ? AND NOT (operations.income != 0 AND operations.odate BETWEEN '2023-02-01' AND '2023-02-28') GROUP BY "categories"."name"  [["user_id", 10]]

   <div class="point-graph">
      <%= line_chart Operation.all.where(:user_id == @user.id).group_by_day(:odate).(:amount) %>
---
SELECT "operations".* FROM "operations" WHERE ("operations"."odate" IS NOT NULL) GROUP BY strftime('%Y-%m-%d', "operations"."odate"), "operations"."amount"