app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_user
        #если переменная пустая то выолнит действие если, нет то не будет выполнять действие после равно
        @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]