app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def index
    if params[:serch_name].present?
      @serach_name = params[:serch_name]

      @categories = User.find_by(id:session[:user_id]).categories.where('name LIKE ?', "%#{ @serach_name }%")

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @pagy, @operations = pagy(User.find_by(id:session[:user_id]).operations.where("category_id Like ?",  params[:id]), items: 10)

INSERT INTO "categories" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Техника"], ["description", "Все что связанно с техникой"], ["created_at", "2023-02-07 12:29:35.583713"], ["updated_at", "2023-02-07 12:29:35.583713"], ["user_id", 7]]
---
  def create

    @category = Category.new(category_params)
    @category.user_id = session[:user_id]

    respond_to do |format|
      if @category.save