app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "operations".* FROM "operations" WHERE "operations"."user_id" = ? AND "operations"."odate" BETWEEN ? AND ? ORDER BY odate DESC LIMIT ?  [["user_id", 10], ["odate", "2023-02-01"], ["odate", "2023-02-28"], ["LIMIT", 3]]
SELECT "operations".* FROM "operations" WHERE "operations"."user_id" = ? AND "operations"."odate" BETWEEN ? AND ? ORDER BY odate LIMIT ?  [["user_id", 10], ["odate", "2023-02-01"], ["odate", "2023-02-28"], ["LIMIT", 5]]
SELECT SUM(costs) FROM "operations"
SELECT "operations".* FROM "operations" WHERE "operations"."user_id" = ? AND "operations"."odate" BETWEEN ? AND ? ORDER BY odate  [["user_id", 10], ["odate", "2023-02-01"], ["odate", "2023-02-28"]]
---
  def MainPage
    if !current_user
      redirect_to root_path
    end

    @user = User.find_by(id: session[:user_id])


    @current_month_today = Date.today
    @current_month_first_day = Date.today.beginning_of_month
    @current_month_last_day = Date.today.end_of_month




    #last operations rails for table
    @last_op = @user.operations.order("odate")
      .where(:odate => @current_month_first_day..@current_month_last_day).last(3).reverse





    op_full_info = @user.operations.order("odate").where(:odate => @current_month_first_day..@current_month_last_day)

    #@op.unshift("start month" => 0)

    start_value = 0


    op_full_info.each do |op|