app/controllers/operations_controller.rb

  def index
    @operations = Operation.all
---
SELECT "operations".* FROM "operations"

  def destroy

    us = User.find_by(id:session[:user_id])
    if @operation.income
      us.current_amount -= @operation.amount
    else
      us.current_amount += @operation.amount
    end

    if us.save
      @operation.destroy
---
DELETE FROM "operations" WHERE "operations"."id" = ?  [["id", 7]]

    def set_operation
      @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]