app/controllers/operations_controller.rb

  def index
    #@operations = User.find_by(id:session[:user_id]).operations
    @pagy, @operations = pagy(User.find_by(id:session[:user_id]).operations, items: 10)
---
SELECT "operations".* FROM "operations" WHERE "operations"."user_id" = ?  [["user_id", 11]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def create
    @operation = Operation.new(operation_params)
    @operation.user_id = session[:user_id]
    respond_to do |format|
      if @operation.save
        us = User.find_by(id:session[:user_id])
        if @operation.income
          us.current_amount += @operation.amount
        else
          us.current_amount -= @operation.amount
        end
        if us.save
---
INSERT INTO "operations" ("amount", "odate", "description", "category_id", "created_at", "updated_at", "user_id", "income") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "current_amount" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-08 09:21:49.266455"], ["current_amount", -1200.0], ["id", 10]]

  def update
    respond_to do |format|

      us = User.find_by(id:session[:user_id])
      if @operation.income
        us.current_amount -= @operation.amount
      else
        us.current_amount += @operation.amount
      end

      if @operation.update(operation_params)
        if @operation.income
          us.current_amount += @operation.amount
        else
          us.current_amount -= @operation.amount
        end
        if us.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "operations" SET "amount" = ?, "updated_at" = ? WHERE "operations"."id" = ?  [["amount", 1400.0], ["updated_at", "2023-02-11 11:47:28.614555"], ["id", 1]]
UPDATE "users" SET "updated_at" = ?, "current_amount" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-11 10:41:37.693618"], ["current_amount", -173.0], ["id", 10]]

  def destroy

    us = User.find_by(id:session[:user_id])
    if @operation.income
      us.current_amount -= @operation.amount
    else
      us.current_amount += @operation.amount
    end

    if us.save
      @operation.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "current_amount" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-11 10:41:37.693618"], ["current_amount", -173.0], ["id", 10]]
DELETE FROM "operations" WHERE "operations"."id" = ?  [["id", 1]]

    def set_operation
      @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]