app/controllers/reports_controller.rb

  def report_by_category
    @operations = Operation.all
---
SELECT "operations".* FROM "operations"

  def report_by_dates
    @operations = Operation.all
---
SELECT "operations".* FROM "operations"