app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "vlaros19992004@gmail.com"], ["LIMIT", 1]]
---
  def create
    user_params = params.require(:session)


    user = User.find_by(email: user_params[:email])

    if user.present?