app/controllers/users_controller.rb

INSERT INTO "users" ("name", "surname", "email", "created_at", "updated_at", "password_digest", "current_amount") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    user_params = params.require(:user).permit(
      :name, :surname, :email, :password, :password_confirmation
    )

    @user = User.new(user_params)

    if @user.save