app/views/reports/report_by_dates.html.erb

    <h2><%= operation.description  %></h2>
    <h4><%= Category.find(operation.category_id).name %></h4>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]