app/views/reports/report_by_category.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <h2><%= operation.description  %></h2>
    <h4><%= Category.find(operation.category_id).name %></h4>