app/views/operations/_form.html.erb

          </div>
          <%= form.select :category_id, options_for_select(User.find_by(id:session[:user_id]).categories.collect{ |u| [u.name, u.id] }), {}, class:"custom-select" %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]